vehicleliveeventservice/Insight_GetVehicleLiveEvent.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1.1 r1855137">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpc3MiOiJodHRwOi8va2Fycm9zdGVjaC5pbyIsInN1YiI6IjlhNDU1MjhmLTM2YzAtNDdlMS1hODcwLTk1OWEzY2NhODUxMyIsInBlcnNvbklkIjoiY2VjZTYzM2QtOTdkZC00YWMxLThiNGUtODI4Y2M5Njc1MjkyIiwidXNlcklkIjoiYWRtaW5Aa2Fycm9zdGVjaC5jb20iLCJpYXQiOjE1Mzg2MjIwMDksImV4cCI6MTUzODYyMzczNDAwMCwiYXVkIjoiMTFiYjRjMTg0NWM3YTAxMzdhZDBiYzhmMWRmMDU1NzkyODQ5ZGYxNiIsInNjb3BlIjpbIio6RWR1bG9nOkFkbWluIl0sImF1dGhvcml6YXRpb24iOnsiZ3JvdXBzIjpbeyJncm91cE5hbWUiOiJFZHVsb2ciLCJyb2xlcyI6WyJTeXN0ZW0gQWRtaW4iXX0seyJncm91cE5hbWUiOiJEcml2ZXIiLCJyb2xlcyI6WyJTeXN0ZW0gQWRtaW4iXX0seyJncm91cE5hbWUiOiJQYXJlbnQiLCJyb2xlcyI6WyJTeXN0ZW0gQWRtaW4iXX0seyJncm91cE5hbWUiOiJUZW5hbnQiLCJyb2xlcyI6WyJTeXN0ZW0gQWRtaW4iXX0seyJncm91cE5hbWUiOiJEZXZlbG9wZXIiLCJyb2xlcyI6WyJTeXN0ZW0gQWRtaW4iXX0seyJncm91cE5hbWUiOiJTY2hvb2wiLCJyb2xlcyI6WyJTeXN0ZW0gQWRtaW4iXX0seyJncm91cE5hbWUiOiJLYXJyb3MiLCJyb2xlcyI6WyJTeXN0ZW0gQWRtaW4iXX1dfX0.fhPPCp4Ei6kwlO7_W2eXxQtnCx3sNK8D1uIUMoIQxOY</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">ApiKey</stringProp>
            <stringProp name="Header.value">11bb4c1845c7a0137ad0bc8f1df055792849df16</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Vehicle Live Event" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">4</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">300</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Search" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;select&quot;: {&#xd;
        &quot;includes&quot;: [],&#xd;
        &quot;excludes&quot;: []&#xd;
    },&#xd;
    &quot;query&quot;: {&#xd;
        &quot;tenantid&quot;: &quot;59ff9686-097c-49cd-ad40-4b07ca6d4611&quot;,&#xd;
        &quot;unitid&quot;: [],&#xd;
        &quot;eventid&quot;: [],&#xd;
        &quot;busid&quot;: [],&#xd;
        &quot;eventtime&quot;: [&#xd;
            {&#xd;
                &quot;from&quot;: &quot;1578114000000&quot;,&#xd;
                &quot;to&quot;: &quot;1578200340000&quot;&#xd;
            }&#xd;
        ],&#xd;
        &quot;location_distance&quot;: [],&#xd;
        &quot;location_polygon&quot;: [],&#xd;
        &quot;sort&quot;: [&#xd;
            {&#xd;
                &quot;field&quot;: &quot;eventtime&quot;,&#xd;
                &quot;order&quot;: &quot;asc&quot;&#xd;
            }&#xd;
        ]&#xd;
    },&#xd;
    &quot;page&quot;: &quot;0&quot;,&#xd;
    &quot;size&quot;: 10000&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">gateway-p01-demo.usw2.karrostech.net</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">api/v1/vehicleliveevents/search</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="View Results in Table" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>